const schedules = {
    '8': {
        'Понедельник': ['музыка  17', 'геом(Фил) 34', 'химия  25', 'а(Т)   15', 'рус(П)  45'],
        'Вторник': ['технол. 110', 'общ(Ч)  11', 'алг(Кек)  34', 'алг(Кек)  34', 'э/к(рус)П  45'],
        'Среда': ['геом(Фил) 34', 'геом(Фил) 34', 'биол(Ф)   25', 'биол(Ф)   25', 'геогр.  27'],
        'Четверг': ['ф-ра(Фог)', 'ф-ра(Фог)', 'а(Т)   15', 'а(Т)   15', 'проф(Ш)  21'],
        'Пятница': ['ФГ(чит)Тол 45', 'химия  25', 'алг(Кек)  34', 'алг(Кек)  34', 'ритмика  17'],
        'Суббота': ['ОБЖ(Б)  31', 'рус(П)  41', 'физ(Кр)  21', 'физ(Кр)  21', 'лит(П)  41']
    },
    '9': {
        'Понедельник': ['музыка  17', 'геом(Фил) 34', 'химия  25', 'а(Т)   15', 'рус(П)  45'],
        'Вторник': ['технол. 110', 'общ(Ч)  11', 'алг(Кек)  34', 'алг(Кек)  34', 'э/к(рус)П  45'],
        'Среда': ['геом(Фил) 34', 'геом(Фил) 34', 'биол(Ф)   25', 'биол(Ф)   25', 'геогр.  27'],
        'Четверг': ['ф-ра(Фог)', 'ф-ра(Фог)', 'а(Т)   15', 'а(Т)   15', 'проф(Ш)  21'],
        'Пятница': ['ФГ(чит)Тол 45', 'химия  25', 'алг(Кек)  34', 'алг(Кек)  34', 'ритмика  17'],
        'Суббота': ['ОБЖ(Б)  31', 'рус(П)  41', 'физ(Кр)  21', 'физ(Кр)  21', 'лит(П)  41']
    },
    '10': {
        'Понедельник': ['Математика', 'Физика', 'Информатика', 'Химия', 'Литература'],
        'Вторник': ['Математика', 'Физика', 'Информатика', 'Химия', 'Литература'],
        'Среда': ['Математика', 'Физика', 'Информатика', 'Химия', 'Литература'],
        'Четверг': ['Музыка', 'ИЗО', 'Информатика', 'Обществознание', 'Технология'],
        'Пятница': ['Музыка', 'ИЗО', 'Информатика', 'Обществознание', 'Технология'],
        'Суббота': ['Музыка', 'ИЗО', 'Информатика', 'Обществознание', 'Технология']
    },
    '11': {
        'Понедельник': ['Математика', 'Физика', 'Информатика', 'Химия', 'Литература'],
        'Вторник': ['Математика', 'Физика', 'Информатика', 'Химия', 'Литература'],
        'Среда': ['Математика', 'Физика', 'Информатика', 'Химия', 'Литература']
    }
};


function loadSchedule(className) {
    const scheduleWrapper = document.getElementById('scheduleWrapper');
    scheduleWrapper.innerHTML = '';

    const scheduleData = schedules[className];


    const table = document.createElement('table');
    const daysOfWeek = Object.keys(scheduleData);

    const headerRow = document.createElement('tr');
    headerRow.innerHTML = '<th>День недели</th><th>1-й урок</th><th>2-й урок</th><th>3-й урок</th><th>4-й урок</th><th>5-й урок</th>';
    table.appendChild(headerRow);


    daysOfWeek.forEach(day => {
        const row = document.createElement('tr');
        row.innerHTML = `<td>${day}</td>`;
        scheduleData[day].forEach(subject => {
            row.innerHTML += `<td>${subject}</td>`;
        });
        table.appendChild(row);
    });


    scheduleWrapper.appendChild(table);
}